---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotToggleDimensionEquality
source: html/38ac9f97-b64e-c0a2-60d8-9cfc1494e89e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotToggleDimensionEquality Property

Toggling the dimension's equality constraint would overconstrain the sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotToggleDimensionEquality { get; }
```